tutorials/pod_time/of_cavity/system/foamToNumpyDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      foamToNumpyDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dataDir       exported_data;

fields
{
    names       (p U);
    dataType    float64;
}

exportData
{
    cellCentre   false;
    cellVolumes  true;
    writeTimes   true;
    dataType     float64;
}

storageOrder   F;

time
{
    startTime   0.01;
    endTime     0.5;
    every       1;
}

// ************************************************************************* //
