tutorials/pod_time/of_cavity/system/numpyToFoamDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      numpyToFoamDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dataDir       reconstruction_data;
fields        (p U);

time
{
    startTime   0.01;
    endTime     0.5;
    deltaT      0.01;
}



// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
